{
  "about-me": "Sobre mim",
  "projects": "Projetos",
  "libraries": "Bibliotecas",
  "skills": "Habilidades",
  "timeline": "Linha do tempo",
  "blog": "Blog",
  "hello": "Olá",
  "apresentation": "Meu nome é",
  "office": "Eu sou Desenvolvedor Full Stack",
  "about-me-description": "Desde o inicio da minha carreira como desenvolvedor sempre busquei aperfeiçoar minhas qualidades e melhorar meus defeitos e em meio a essas experiências encontrei pessoas talentosas que me ajudaram não só a buscar a melhor solução, mas uma solução performático para o problema e desde então sou apaixonado pelo que faço.",
  "about-me-description-ph": "Eu não apenas escrevo código, eu resolvo problemas.",
  "btn-download-cv": "Baixar currículo",
  "footer-contacts": "Contatos",
  "footer-follow-me": "Siga-me",
  "libraries-text-button": "Ver Documentação",
  "libraries-broleto-desc": "Uma biblioteca que suporta validação e obtenção dos dados de boletos bancários ou arrecadação seja pela linha digitável ou código de barras com ou sem formatação.",
  "timeline-cm-date": "Julho/2020 - Atual",
  "timeline-cm-title": "Desenvolvedor Back End na Casa Magalhães",
  "timeline-cm-description": "Atuo no desenvolvimento de soluções para simplificar a gestão de varejos e food-service com mais de 18 mil clientes em 27 estados do Brasil.",
  "timeline-hub-date": "Outubro/2019 - Julho/2020",
  "timeline-hub-title": "Desenvolvedor Full Stack na Hubtec Tecnologia & Inovação",
  "timeline-hub-description": "Atuei no desenvolvimento de aplicações Web e Mobile para projetos de Finanças, Saúde e entre outros.",
  "timeline-code-date": "2020",
  "timeline-code-title": "Curso AceleraDev React at Codenation",
  "timeline-code-description": "A Codenation é uma Edtech com objetivo de formar profisionais para o setor de T.I. Tive a oportunidade de participar do AceleraDev React onde pude trabalhar com as principais bibliotecas do ecosistema do React como Redux. Pode aprender tambem sobre padrões de projetos, integrações e utilizar APIs do React como useEffect, useCallback, useState, useRef e useContext.",
  "timeline-ufc-date": "Fevereiro/2016 - Dezembro/2018",
  "timeline-ufc-title": "Graduado em Redes de Computadores pela Universidade Federal do Ceará",
  "timeline-ufc-description": "O curso de graduação de Redes de Computadores da UFC é diferenciado pois possui disciplinas voltado para infraestrutura e disciplinas de programção, desde o básico até disciplinas voltado para desenvolvimento desenvolvimento Web e sistemas distribuidos."
}
