{
  "banner": {
    "title": "broleto",
    "description": "Valide e obtenha dados de boleto bancário/arrecadação de forma fácil",
    "image": {
      "url": "/images/broleto.png",
      "alt": "Barras verticais semelhantes ao um codigo de barra nas cores verde, amarelo e azul representando a bandeira do Brasil"
    }
  },
  "tableContent": {
    "title": "Conteúdo",
    "contents": [
      {
        "title": "Introdução",
        "anchor": "#introduction"
      },
      {
        "title": "Instalação",
        "anchor": "#installation"
      },
      {
        "title": "Uso",
        "anchor": "#usage"
      }
    ]
  },
  "sections": {

    "introduction": {
      "id": "introduction",
      "title": "Introdução",
      "descriptions": [
        "No Brasil existe um método de pagamento muito utilizado chamado Boleto Bancário que consiste em uma série de números onde é possível extrair informações sobre o pagamento como o banco que emitiu tal boleto (se houver), data de vencimento, valor a ser pago e entre outras informações.",
        "Apesar dessas informações serem facilmente extraida de um papel, porém, quando temos apenas números isso torna uma tarefa chata, pois precisamos estar atento a diversas informações como se o digito verificador está correto, qual o tipo de boleto (Arrecadação ou Banco) ou se os números são de uma linha digitável ou código de barras e etc...",
        "Pensando nisso, decidi idealizar a criação de uma biblioteca que pudesse ajudar tanto na validação de boletos como na obtenção de informações dos mesmos. Abaixo, apresento as etapas de instalações e funcionalidades da biblioteca."
      ]
    },
    "installation": {
      "id": "installation",
      "title": "Instalação",
      "descriptions": [
        "A biblioteca broleto está disponivel para Javascript/Typescript e futuramente em Dart"
      ],
      "codes": [
        {
          "label": "JS/TS",
          "language": "bash",
          "code": "npm i broleto"
        }
      ]
    },
    "usage": {
      "id": "usage",
      "title": "Uso",
      "descriptions": [
        "Para usar todas as funcionalidades, é necessário importar a classe ",
        "Boleto ",
        " e criar uma instância como mostrrado abaixo:"
      ],
      "codes": [
        {
          "label": "CommonJS",
          "language": "javascript",
          "code": "const { Boleto } = require('broleto');\n\nconst boleto = new Boleto('34191091070000013555851122200002157810000115300');"
        },
        {
          "label": "ES6/TS",
          "language": "javascript",
          "code": "import { Boleto } from 'broleto';\n\nconst boleto = new Boleto('34191091070000013555851122200002157810000115300');"
        }
      ]
    },
    "functionality": {
      "id": "functionality",
      "title": "Funcionalidade",
      "descriptions": [
        "A biblioteca possui varias funções que ajuda na validação do boleto e para obter informações como data de validade, valor do boleto, verifica se o boleto está expirado, além de outras funções que auxilia para calcular os juros."
      ]
    }
  }
}
